Data Manipulation 
---

In [2]:
import pandas as pd


data = [
    {'student id': 1, 'name': 'Alice', 'age': 18, 'marks': 85},
    {'student id': 2, 'name': 'Bob', 'age': 19, 'marks': 92},
    {'student id': 3, 'name': 'Charlie', 'age': 18, 'marks': 78},
    {'student id': 4, 'name': 'David', 'age': 20, 'marks': 90},
    {'student id': 5, 'name': 'Eva', 'age': 19, 'marks': 88},
    {'student id': 6, 'name': 'Frank', 'age': 18, 'marks': 75},
    {'student id': 7, 'name': 'Grace', 'age': 20, 'marks': 95},
    {'student id': 8, 'name': 'Hannah', 'age': 19, 'marks': 81},
    {'student id': 9, 'name': 'Ivy', 'age': 18, 'marks': 89},
    {'student id': 10, 'name': 'Jack', 'age': 20, 'marks': 84}
]


df = pd.DataFrame(data)

print(df)

   student id     name  age  marks
0           1    Alice   18     85
1           2      Bob   19     92
2           3  Charlie   18     78
3           4    David   20     90
4           5      Eva   19     88
5           6    Frank   18     75
6           7    Grace   20     95
7           8   Hannah   19     81
8           9      Ivy   18     89
9          10     Jack   20     84

In [4]:
df

   student id     name  age  marks
0           1    Alice   18     85
1           2      Bob   19     92
2           3  Charlie   18     78
3           4    David   20     90
4           5      Eva   19     88
5           6    Frank   18     75
6           7    Grace   20     95
7           8   Hannah   19     81
8           9      Ivy   18     89
9          10     Jack   20     84

In [6]:
import string

In [8]:
df['name'].str.upper()

0      ALICE
1        BOB
2    CHARLIE
3      DAVID
4        EVA
5      FRANK
6      GRACE
7     HANNAH
8        IVY
9       JACK
Name: name, dtype: object

In [12]:
df['name'].str.lower()

0      alice
1        bob
2    charlie
3      david
4        eva
5      frank
6      grace
7     hannah
8        ivy
9       jack
Name: name, dtype: object

In [14]:
df['name'].str.title()

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
5      Frank
6      Grace
7     Hannah
8        Ivy
9       Jack
Name: name, dtype: object

In [16]:
df['name'].str.capitalize()

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
5      Frank
6      Grace
7     Hannah
8        Ivy
9       Jack
Name: name, dtype: object

In [18]:
df['name'].str.replace("Alice",'Alex')

0       Alex
1        Bob
2    Charlie
3      David
4        Eva
5      Frank
6      Grace
7     Hannah
8        Ivy
9       Jack
Name: name, dtype: object

In [22]:
df['name'].replace("Bob","Bobby")

0      Alice
1      Bobby
2    Charlie
3      David
4        Eva
5      Frank
6      Grace
7     Hannah
8        Ivy
9       Jack
Name: name, dtype: object

In [24]:
df

   student id     name  age  marks
0           1    Alice   18     85
1           2      Bob   19     92
2           3  Charlie   18     78
3           4    David   20     90
4           5      Eva   19     88
5           6    Frank   18     75
6           7    Grace   20     95
7           8   Hannah   19     81
8           9      Ivy   18     89
9          10     Jack   20     84

In [26]:
df['name'].replace("Alice","Alex",inplace=True)

In [28]:
df

   student id     name  age  marks
0           1     Alex   18     85
1           2      Bob   19     92
2           3  Charlie   18     78
3           4    David   20     90
4           5      Eva   19     88
5           6    Frank   18     75
6           7    Grace   20     95
7           8   Hannah   19     81
8           9      Ivy   18     89
9          10     Jack   20     84

In [30]:
df['name'].str.isalpha()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: name, dtype: bool

In [32]:
df['name'].str.isalnum()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: name, dtype: bool

In [34]:
df['name'].str.isspace()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: name, dtype: bool

In [36]:
df['name'].str.lstrip()

0       Alex
1        Bob
2    Charlie
3      David
4        Eva
5      Frank
6      Grace
7     Hannah
8        Ivy
9       Jack
Name: name, dtype: object

In [38]:
df['name'].str.rstrip()

0       Alex
1        Bob
2    Charlie
3      David
4        Eva
5      Frank
6      Grace
7     Hannah
8        Ivy
9       Jack
Name: name, dtype: object

In [40]:
df['name'].str.strip()

0       Alex
1        Bob
2    Charlie
3      David
4        Eva
5      Frank
6      Grace
7     Hannah
8        Ivy
9       Jack
Name: name, dtype: object

In [46]:
import pandas as pd

data = {
    'Student ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Full Name': ['Alice Smith', 'Bob Johnson', 'Charlie Brown', 'David Lee', 'Eva Williams', 'Frank Miller', 'Grace Davis', 'Henry Wilson', 'Ivy Moore', 'Jack Taylor'],
    'Age': [18, 19, 18, 20, 19, 18, 20, 19, 18, 20],
    'Marks': [85, 92, 78, 90, 88, 75, 95, 82, 89, 79]
}

df = pd.DataFrame(data)

print(df)

   Student ID      Full Name  Age  Marks
0         101    Alice Smith   18     85
1         102    Bob Johnson   19     92
2         103  Charlie Brown   18     78
3         104      David Lee   20     90
4         105   Eva Williams   19     88
5         106   Frank Miller   18     75
6         107    Grace Davis   20     95
7         108   Henry Wilson   19     82
8         109      Ivy Moore   18     89
9         110    Jack Taylor   20     79

In [50]:
df['Full Name'].str.split()

0      [Alice, Smith]
1      [Bob, Johnson]
2    [Charlie, Brown]
3        [David, Lee]
4     [Eva, Williams]
5     [Frank, Miller]
6      [Grace, Davis]
7     [Henry, Wilson]
8        [Ivy, Moore]
9      [Jack, Taylor]
Name: Full Name, dtype: object

In [54]:
df['Full Name'].str.split("e")

0      [Alic,  Smith]
1       [Bob Johnson]
2    [Charli,  Brown]
3       [David L, , ]
4      [Eva Williams]
5     [Frank Mill, r]
6      [Grac,  Davis]
7     [H, nry Wilson]
8        [Ivy Moor, ]
9       [Jack Taylor]
Name: Full Name, dtype: object

In [58]:
df[['First','Last']]= df['Full Name'].str.split(" ",expand=True)

In [60]:
df

   Student ID      Full Name  Age  Marks    First      Last
0         101    Alice Smith   18     85    Alice     Smith
1         102    Bob Johnson   19     92      Bob   Johnson
2         103  Charlie Brown   18     78  Charlie     Brown
3         104      David Lee   20     90    David       Lee
4         105   Eva Williams   19     88      Eva  Williams
5         106   Frank Miller   18     75    Frank    Miller
6         107    Grace Davis   20     95    Grace     Davis
7         108   Henry Wilson   19     82    Henry    Wilson
8         109      Ivy Moore   18     89      Ivy     Moore
9         110    Jack Taylor   20     79     Jack    Taylor

In [62]:
df['(x,y)'] = df['Full Name'].str.split()

In [64]:
df

   Student ID      Full Name  Age  Marks    First      Last             (x,y)
0         101    Alice Smith   18     85    Alice     Smith    [Alice, Smith]
1         102    Bob Johnson   19     92      Bob   Johnson    [Bob, Johnson]
2         103  Charlie Brown   18     78  Charlie     Brown  [Charlie, Brown]
3         104      David Lee   20     90    David       Lee      [David, Lee]
4         105   Eva Williams   19     88      Eva  Williams   [Eva, Williams]
5         106   Frank Miller   18     75    Frank    Miller   [Frank, Miller]
6         107    Grace Davis   20     95    Grace     Davis    [Grace, Davis]
7         108   Henry Wilson   19     82    Henry    Wilson   [Henry, Wilson]
8         109      Ivy Moore   18     89      Ivy     Moore      [Ivy, Moore]
9         110    Jack Taylor   20     79     Jack    Taylor    [Jack, Taylor]

In [72]:
df.drop(columns=['(x,y)'],axis=1,inplace=True)

In [74]:
df

   Student ID      Full Name  Age  Marks    First      Last
0         101    Alice Smith   18     85    Alice     Smith
1         102    Bob Johnson   19     92      Bob   Johnson
2         103  Charlie Brown   18     78  Charlie     Brown
3         104      David Lee   20     90    David       Lee
4         105   Eva Williams   19     88      Eva  Williams
5         106   Frank Miller   18     75    Frank    Miller
6         107    Grace Davis   20     95    Grace     Davis
7         108   Henry Wilson   19     82    Henry    Wilson
8         109      Ivy Moore   18     89      Ivy     Moore
9         110    Jack Taylor   20     79     Jack    Taylor

In [80]:
df = df.iloc[:,:4]

In [82]:
df

   Student ID      Full Name  Age  Marks
0         101    Alice Smith   18     85
1         102    Bob Johnson   19     92
2         103  Charlie Brown   18     78
3         104      David Lee   20     90
4         105   Eva Williams   19     88
5         106   Frank Miller   18     75
6         107    Grace Davis   20     95
7         108   Henry Wilson   19     82
8         109      Ivy Moore   18     89
9         110    Jack Taylor   20     79

In [ ]:
map() -> it works on Series

apply() -> it works on DataFrame

In [86]:
df['Age']

0    18
1    19
2    18
3    20
4    19
5    18
6    20
7    19
8    18
9    20
Name: Age, dtype: int64

In [90]:
df['Age'].map(lambda x : "Minor" if x<=18 else "Major")

0    Minor
1    Major
2    Minor
3    Major
4    Major
5    Minor
6    Major
7    Major
8    Minor
9    Major
Name: Age, dtype: object

In [92]:
df['Age_Status'] = df['Age'].map(lambda x : "Minor" if x<=18 else "Major")

In [94]:
df

   Student ID      Full Name  Age  Marks Age_Status
0         101    Alice Smith   18     85      Minor
1         102    Bob Johnson   19     92      Major
2         103  Charlie Brown   18     78      Minor
3         104      David Lee   20     90      Major
4         105   Eva Williams   19     88      Major
5         106   Frank Miller   18     75      Minor
6         107    Grace Davis   20     95      Major
7         108   Henry Wilson   19     82      Major
8         109      Ivy Moore   18     89      Minor
9         110    Jack Taylor   20     79      Major

In [96]:
def student_age_status(age):
    if age<=18:
        return "Minor"
    else:
        return "Major"


df['Student_Age_Status'] = df['Age'].map(student_age_status)

In [98]:
df

   Student ID      Full Name  Age  Marks Age_Status Student_Age_Status
0         101    Alice Smith   18     85      Minor              Minor
1         102    Bob Johnson   19     92      Major              Major
2         103  Charlie Brown   18     78      Minor              Minor
3         104      David Lee   20     90      Major              Major
4         105   Eva Williams   19     88      Major              Major
5         106   Frank Miller   18     75      Minor              Minor
6         107    Grace Davis   20     95      Major              Major
7         108   Henry Wilson   19     82      Major              Major
8         109      Ivy Moore   18     89      Minor              Minor
9         110    Jack Taylor   20     79      Major              Major

In [100]:
df.map(lambda x : x*2)

,Student ID,Full Name,Age,Marks,Age_Status,Student_Age_Status
0,202,Alice SmithAlice Smith,36,170,MinorMinor,MinorMinor
1,204,Bob JohnsonBob Johnson,38,184,MajorMajor,MajorMajor
2,206,Charlie BrownCharlie Brown,36,156,MinorMinor,MinorMinor
3,208,David LeeDavid Lee,40,180,MajorMajor,MajorMajor
4,210,Eva WilliamsEva Williams,38,176,MajorMajor,MajorMajor
5,212,Frank MillerFrank Miller,36,150,MinorMinor,MinorMinor
6,214,Grace DavisGrace Davis,40,190,MajorMajor,MajorMajor
7,216,Henry WilsonHenry Wilson,38,164,MajorMajor,MajorMajor
8,218,Ivy MooreIvy Moore,36,178,MinorMinor,MinorMinor
9,220,Jack TaylorJack Taylor,40,158,MajorMajor,MajorMajor

In [102]:
df[['Age','Marks']].map(lambda x : x*2)

   Age  Marks
0   36    170
1   38    184
2   36    156
3   40    180
4   38    176
5   36    150
6   40    190
7   38    164
8   36    178
9   40    158

In [104]:
df[['Age','Marks']].apply(lambda x : x*2)

   Age  Marks
0   36    170
1   38    184
2   36    156
3   40    180
4   38    176
5   36    150
6   40    190
7   38    164
8   36    178
9   40    158

In [108]:
df['Grade'] = df[['Age','Marks']].apply(lambda x : x['Age']+x['Marks'],axis=1)

In [110]:
df

   Student ID      Full Name  Age  Marks Age_Status Student_Age_Status  Grade
0         101    Alice Smith   18     85      Minor              Minor    103
1         102    Bob Johnson   19     92      Major              Major    111
2         103  Charlie Brown   18     78      Minor              Minor     96
3         104      David Lee   20     90      Major              Major    110
4         105   Eva Williams   19     88      Major              Major    107
5         106   Frank Miller   18     75      Minor              Minor     93
6         107    Grace Davis   20     95      Major              Major    115
7         108   Henry Wilson   19     82      Major              Major    101
8         109      Ivy Moore   18     89      Minor              Minor    107
9         110    Jack Taylor   20     79      Major              Major     99

In [142]:
def student(data):
    return pd.Series({
        'X': data['Age'] + data['Marks'],
        'Y': data['Age'] - data['Marks']
        })

In [144]:
df[['X', 'Y']] = df.apply(student, axis=1)

In [146]:
df

,Student ID,Full Name,Age,Marks,Age_Status,Student_Age_Status,Grade,Final,X,Y
0,101,Alice Smith,18,85,Minor,Minor,103,B,103,-67
1,102,Bob Johnson,19,92,Major,Major,111,A,111,-73
2,103,Charlie Brown,18,78,Minor,Minor,96,B,96,-60
3,104,David Lee,20,90,Major,Major,110,B,110,-70
4,105,Eva Williams,19,88,Major,Major,107,B,107,-69
5,106,Frank Miller,18,75,Minor,Minor,93,B,93,-57
6,107,Grace Davis,20,95,Major,Major,115,A,115,-75
7,108,Henry Wilson,19,82,Major,Major,101,B,101,-63
8,109,Ivy Moore,18,89,Minor,Minor,107,B,107,-71
9,110,Jack Taylor,20,79,Major,Major,99,B,99,-59

In [148]:
df['Final'] = df[['Age','Marks']].apply(lambda x : "A" if (x['Age']>18 and x['Marks']>90) else "B", axis=1 )

In [150]:
df

,Student ID,Full Name,Age,Marks,Age_Status,Student_Age_Status,Grade,Final,X,Y
0,101,Alice Smith,18,85,Minor,Minor,103,B,103,-67
1,102,Bob Johnson,19,92,Major,Major,111,A,111,-73
2,103,Charlie Brown,18,78,Minor,Minor,96,B,96,-60
3,104,David Lee,20,90,Major,Major,110,B,110,-70
4,105,Eva Williams,19,88,Major,Major,107,B,107,-69
5,106,Frank Miller,18,75,Minor,Minor,93,B,93,-57
6,107,Grace Davis,20,95,Major,Major,115,A,115,-75
7,108,Henry Wilson,19,82,Major,Major,101,B,101,-63
8,109,Ivy Moore,18,89,Minor,Minor,107,B,107,-71
9,110,Jack Taylor,20,79,Major,Major,99,B,99,-59

In [152]:
df.sort_values(by=['Age'])

,Student ID,Full Name,Age,Marks,Age_Status,Student_Age_Status,Grade,Final,X,Y
0,101,Alice Smith,18,85,Minor,Minor,103,B,103,-67
2,103,Charlie Brown,18,78,Minor,Minor,96,B,96,-60
5,106,Frank Miller,18,75,Minor,Minor,93,B,93,-57
8,109,Ivy Moore,18,89,Minor,Minor,107,B,107,-71
1,102,Bob Johnson,19,92,Major,Major,111,A,111,-73
4,105,Eva Williams,19,88,Major,Major,107,B,107,-69
7,108,Henry Wilson,19,82,Major,Major,101,B,101,-63
3,104,David Lee,20,90,Major,Major,110,B,110,-70
6,107,Grace Davis,20,95,Major,Major,115,A,115,-75
9,110,Jack Taylor,20,79,Major,Major,99,B,99,-59

In [154]:
df.sort_values(by=['Age'],ascending=False)

,Student ID,Full Name,Age,Marks,Age_Status,Student_Age_Status,Grade,Final,X,Y
3,104,David Lee,20,90,Major,Major,110,B,110,-70
6,107,Grace Davis,20,95,Major,Major,115,A,115,-75
9,110,Jack Taylor,20,79,Major,Major,99,B,99,-59
1,102,Bob Johnson,19,92,Major,Major,111,A,111,-73
4,105,Eva Williams,19,88,Major,Major,107,B,107,-69
7,108,Henry Wilson,19,82,Major,Major,101,B,101,-63
0,101,Alice Smith,18,85,Minor,Minor,103,B,103,-67
2,103,Charlie Brown,18,78,Minor,Minor,96,B,96,-60
5,106,Frank Miller,18,75,Minor,Minor,93,B,93,-57
8,109,Ivy Moore,18,89,Minor,Minor,107,B,107,-71

In [156]:
df.sort_values(by=['Age','Marks'],ascending=False)

,Student ID,Full Name,Age,Marks,Age_Status,Student_Age_Status,Grade,Final,X,Y
6,107,Grace Davis,20,95,Major,Major,115,A,115,-75
3,104,David Lee,20,90,Major,Major,110,B,110,-70
9,110,Jack Taylor,20,79,Major,Major,99,B,99,-59
1,102,Bob Johnson,19,92,Major,Major,111,A,111,-73
4,105,Eva Williams,19,88,Major,Major,107,B,107,-69
7,108,Henry Wilson,19,82,Major,Major,101,B,101,-63
8,109,Ivy Moore,18,89,Minor,Minor,107,B,107,-71
0,101,Alice Smith,18,85,Minor,Minor,103,B,103,-67
2,103,Charlie Brown,18,78,Minor,Minor,96,B,96,-60
5,106,Frank Miller,18,75,Minor,Minor,93,B,93,-57

In [158]:
df.sort_index()

,Student ID,Full Name,Age,Marks,Age_Status,Student_Age_Status,Grade,Final,X,Y
0,101,Alice Smith,18,85,Minor,Minor,103,B,103,-67
1,102,Bob Johnson,19,92,Major,Major,111,A,111,-73
2,103,Charlie Brown,18,78,Minor,Minor,96,B,96,-60
3,104,David Lee,20,90,Major,Major,110,B,110,-70
4,105,Eva Williams,19,88,Major,Major,107,B,107,-69
5,106,Frank Miller,18,75,Minor,Minor,93,B,93,-57
6,107,Grace Davis,20,95,Major,Major,115,A,115,-75
7,108,Henry Wilson,19,82,Major,Major,101,B,101,-63
8,109,Ivy Moore,18,89,Minor,Minor,107,B,107,-71
9,110,Jack Taylor,20,79,Major,Major,99,B,99,-59

In [160]:
df.sort_index(ascending=False)

,Student ID,Full Name,Age,Marks,Age_Status,Student_Age_Status,Grade,Final,X,Y
9,110,Jack Taylor,20,79,Major,Major,99,B,99,-59
8,109,Ivy Moore,18,89,Minor,Minor,107,B,107,-71
7,108,Henry Wilson,19,82,Major,Major,101,B,101,-63
6,107,Grace Davis,20,95,Major,Major,115,A,115,-75
5,106,Frank Miller,18,75,Minor,Minor,93,B,93,-57
4,105,Eva Williams,19,88,Major,Major,107,B,107,-69
3,104,David Lee,20,90,Major,Major,110,B,110,-70
2,103,Charlie Brown,18,78,Minor,Minor,96,B,96,-60
1,102,Bob Johnson,19,92,Major,Major,111,A,111,-73
0,101,Alice Smith,18,85,Minor,Minor,103,B,103,-67

Data Grouping
---

In [175]:
import pandas as pd
from datetime import datetime


data = {
    'emp id': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'full name': ['Alice Smith', 'Bob Johnson', 'Charlie Williams', 'Diana Brown', 'Eve Jones',
                  'Frank Garcia', 'Grace Miller', 'Henry Davis', 'Ivy Rodriguez', 'Jack Martinez'],
    'salary': [60000, 75000, 50000, 80000, 65000, 70000, 55000, 90000, 62000, 78000],
    'department': ['HR', 'IT', 'Sales', 'IT', 'Finance', 'Sales', 'HR', 'IT', 'Finance', 'Sales'],
    'position': ['Manager', 'Engineer', 'Associate', 'Manager', 'Analyst', 'Associate', 'Analyst', 'Manager', 'Analyst', 'Engineer'],
    'hiredate': [
        datetime(2020, 1, 15), datetime(2019, 3, 10), datetime(2021, 5, 20), datetime(2018, 11, 1),
        datetime(2022, 9, 30), datetime(2020, 6, 25), datetime(2023, 2, 18), datetime(2017, 7, 7),
        datetime(2022, 4, 12), datetime(2021, 12, 1)
    ]
}

df = pd.DataFrame(data)

print(df)

   emp id         full name  salary department   position   hiredate
0     101       Alice Smith   60000         HR    Manager 2020-01-15
1     102       Bob Johnson   75000         IT   Engineer 2019-03-10
2     103  Charlie Williams   50000      Sales  Associate 2021-05-20
3     104       Diana Brown   80000         IT    Manager 2018-11-01
4     105         Eve Jones   65000    Finance    Analyst 2022-09-30
5     106      Frank Garcia   70000      Sales  Associate 2020-06-25
6     107      Grace Miller   55000         HR    Analyst 2023-02-18
7     108       Henry Davis   90000         IT    Manager 2017-07-07
8     109     Ivy Rodriguez   62000    Finance    Analyst 2022-04-12
9     110     Jack Martinez   78000      Sales   Engineer 2021-12-01

In [177]:
df

   emp id         full name  salary department   position   hiredate
0     101       Alice Smith   60000         HR    Manager 2020-01-15
1     102       Bob Johnson   75000         IT   Engineer 2019-03-10
2     103  Charlie Williams   50000      Sales  Associate 2021-05-20
3     104       Diana Brown   80000         IT    Manager 2018-11-01
4     105         Eve Jones   65000    Finance    Analyst 2022-09-30
5     106      Frank Garcia   70000      Sales  Associate 2020-06-25
6     107      Grace Miller   55000         HR    Analyst 2023-02-18
7     108       Henry Davis   90000         IT    Manager 2017-07-07
8     109     Ivy Rodriguez   62000    Finance    Analyst 2022-04-12
9     110     Jack Martinez   78000      Sales   Engineer 2021-12-01

In [179]:
df.groupby('department')['salary'].mean()

department
Finance    63500.000000
HR         57500.000000
IT         81666.666667
Sales      66000.000000
Name: salary, dtype: float64

In [181]:
df.groupby('position')['salary'].mean()

position
Analyst      60666.666667
Associate    60000.000000
Engineer     76500.000000
Manager      76666.666667
Name: salary, dtype: float64

In [183]:
df.groupby('department').count()

            emp id  full name  salary  position  hiredate
department
Finance          2          2       2         2         2
HR               2          2       2         2         2
IT               3          3       3         3         3
Sales            3          3       3         3         3

In [185]:
df.groupby('department').size()

department
Finance    2
HR         2
IT         3
Sales      3
dtype: int64

In [187]:
df.groupby('emp id')['salary'].mean()

emp id
101    60000.0
102    75000.0
103    50000.0
104    80000.0
105    65000.0
106    70000.0
107    55000.0
108    90000.0
109    62000.0
110    78000.0
Name: salary, dtype: float64

In [189]:
df.groupby(['position','department'])['salary'].mean()

position   department
Analyst    Finance       63500.0
           HR            55000.0
Associate  Sales         60000.0
Engineer   IT            75000.0
           Sales         78000.0
Manager    HR            60000.0
           IT            85000.0
Name: salary, dtype: float64

In [191]:
df.groupby(['department','position'])['salary'].mean()

department  position
Finance     Analyst      63500.0
HR          Analyst      55000.0
            Manager      60000.0
IT          Engineer     75000.0
            Manager      85000.0
Sales       Associate    60000.0
            Engineer     78000.0
Name: salary, dtype: float64

In [193]:
df.groupby(['department','position'])['salary'].agg(['mean','max','min'])

                         mean    max    min
department position
Finance    Analyst    63500.0  65000  62000
HR         Analyst    55000.0  55000  55000
           Manager    60000.0  60000  60000
IT         Engineer   75000.0  75000  75000
           Manager    85000.0  90000  80000
Sales      Associate  60000.0  70000  50000
           Engineer   78000.0  78000  78000

In [207]:
df.groupby(['department','position'])['salary'].agg(
    Salary_Max = 'max',
    Salary_Min = 'min',
    Salary_Mean = 'mean'
)

                      Salary_Max  Salary_Min  Salary_Mean
department position
Finance    Analyst         65000       62000      63500.0
HR         Analyst         55000       55000      55000.0
           Manager         60000       60000      60000.0
IT         Engineer        75000       75000      75000.0
           Manager         90000       80000      85000.0
Sales      Associate       70000       50000      60000.0
           Engineer        78000       78000      78000.0